package by.javatr.task03.runner;

//Task 3
//Программа обработки текста, который может быть получен как с консоли, так и с файла.
//1. В каждом слове k-ю букву заменить заданным символом. Если k больше длины слова,
//корректировку не выполнять.
//2. В тексте после буквы Р, если она не последняя в слове, ошибочно напечатана буква А
//вместо О. Внести исправления в текст.
//3. В тексте слова заданной длины заменить указанной подстрокой, длина которой может
//не совпадать с длиной слова.
//4. Из небольшого текста удалить все символы, кроме пробелов,
//не являющиеся буквами. Между последовательностями подряд идущих букв оставить
//хотя бы один пробел.
//5. Из текста удалить все слова заданной длины, начинающиеся на согласную букву.

/**
 * @author Aleh Yemelyanchyk on 12/9/2019.
 */
public class Task03Run {

    public static void main(String[] args) {
    }
}
